Catalogs/КлассификаторПродукцииПоВидамДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>КлассификаторПродукцииПоВидамДеятельности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаСтатистическогоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСвободныхСтрокФормСтатистики</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСвободныхСтрокФормСтатистики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлассификаторПродукцииПоВидамДеятельности/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ДополнятьКодПриЧтенииДанныхКлассификатора() Экспорт
	
	Возврат Ложь;	
	
КонецФункции	

Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	
	// Получим у БРО данные заполнения
	ПараметрыКлассификатора = ИнтерфейсыВзаимодействияБРО.ПолучитьРасположениеКлассификатораСтатистики("КлассификаторПродукцииПоВидамДеятельности");
	ОбластьИсточникДанных 	= ПараметрыКлассификатора.ОбластьИсточникДанных;
	ОтчетИсточникДанных 	= ПараметрыКлассификатора.ОтчетИсточникДанных;
	СписокВерсий 			= ИнтерфейсыВзаимодействияБРО.ПолучитьВерсииСписковОтчета(ОтчетИсточникДанных);
	Если СписокВерсий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяМакетаСписков = СписокВерсий[СписокВерсий.Количество() - 1].Значение;
	
	//Получаем полную таблицу элементов классификатора
	// в таблице содержатся Код и Наименование, элементов классификатора
	ДанныеКлассификатора = ИнтерфейсыВзаимодействияБРО.ПолучитьЗначенияИзСпискаВыбораОтчета(
		ОтчетИсточникДанных, 
		ИмяМакетаСписков, 
		ОбластьИсточникДанных,
		ДополнятьКодПриЧтенииДанныхКлассификатора(),
		Метаданные.Справочники.КлассификаторПродукцииПоВидамДеятельности.ДлинаКода);
		
	// Для разных назначений разные наборы единиц измерения
	ОбластьЕдиницаИзмерения = Перечисления.ВидыСвободныхСтрокФормСтатистики.ИмяОбластиЕдиницаИзмерения(Перечисления.ВидыСвободныхСтрокФормСтатистики.ВидыПродукцииРозница);
	Если ОбластьЕдиницаИзмерения <> Неопределено Тогда 
		
		ЕдиницыИзмеренияРозница = ИнтерфейсыВзаимодействияБРО.ПолучитьЗначенияИзСпискаВыбораОтчета(
			ОтчетИсточникДанных, 
			ИмяМакетаСписков, 
			ОбластьЕдиницаИзмерения);
			
		Если ЕдиницыИзмеренияРозница.Колонки.Найти("okp") = Неопределено Тогда
			ЕдиницыИзмеренияРозница = Неопределено;
		КонецЕсли;
			
	Иначе
		
		ЕдиницыИзмеренияРозница = Неопределено;
			
	КонецЕсли;
		
	// Заполним реквизиты предопределенного элемента данными классификатора
	Объект = РозницаВсего.ПолучитьОбъект();
	Объект.ВидСвободныхСтрокФормСтатистики = Перечисления.ВидыСвободныхСтрокФормСтатистики.ВидыПродукцииРозница;
	
	ДанныеЭлементаКлассификатора = ДанныеКлассификатора.Найти(Объект.Код, "Код");
	Если ДанныеЭлементаКлассификатора = Неопределено Тогда
		Возврат;
	КонецЕслИ;
	
	ОписаниеЕдиницыИзмерения = ЕдиницыИзмеренияРозница.Найти(ДанныеЭлементаКлассификатора.Код, "okp");
	Если ОписаниеЕдиницыИзмерения <> Неопределено Тогда
		
		КодЕдиницыИзмерения          = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ОписаниеЕдиницыИзмерения.Код, 3);
		НаименованиеЕдиницыИзмерения = ОписаниеЕдиницыИзмерения.Наименование;
		
		Объект.ЕдиницаСтатистическогоУчета = Справочники.КлассификаторЕдиницИзмерения.ЕдиницаИзмеренияПоКоду(
			КодЕдиницыИзмерения, 
			НаименованиеЕдиницыИзмерения);
		
	КонецЕсли;
	
	Объект.НаименованиеПолное = ДанныеЭлементаКлассификатора.Наименование;
	Объект.Наименование       = ДанныеЭлементаКлассификатора.Наименование;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
		
	Если Параметры.Свойство("ДанныеКлассификатора") И Параметры.ДанныеКлассификатора Тогда 
		
		СтандартнаяОбработка = Ложь;
		
		ВыбраннаяФорма = "ОбщаяФорма.ДобавлениеЭлементовВКлассификатор";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
